// 1.створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль.

// let menu1 = [1, 2, 3, 4, 5];
// let menu2 = ['aa', 'bb', 'cc', 'dd', 'ee'];
// let menu3 = [25, 12, true, false, 'ee'];
//
// console.log(menu1);
// console.log(menu2);
// console.log(menu3);

// 2. Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// let menu = [];
// menu[0] = 3;
// menu[1] = 5;
// menu[2] = 7;
// console.log(menu);


// 3. За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

// for (let i = 0; i < 10; i++) {
//     document.write(`<div>text</div>`);
// }

// for (let i = 0; i < 10; i++) {
//     document.write(`<div>${i} text</div>`);
// }

// let i = 0;
// while (i < 20) {
//     document.write(`<h1>text</h1>`);
//     i++;
// }

// let i = 0;
// while (i < 20) {
//     document.write(`<h1>${i} text</h1>`);
//     i++;
// }


// 4.Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

// let menuA = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// for (let i of menuA) {
//     console.log(i);
// }
//
// let menuB = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'];
// for (i = 0; i < 10; i++) {
//     console.log(menuB[i]);
// }
//
// let menuC = [12, 'b', 'c', 0, 'e', true, false, 'h', 'i', 'j'];
// for (i = 0; i < 10; i++) {
//     console.log(menuC[i]);
// }

// let menuD = [12, 'b', 'c', 0, 'e', true, false, 'h', 'i', 'j'];
// for (i = 0; i < 10; i++) {
//     if (typeof menuD[i] === 'boolean') {
//         console.log(menuD[i]);
//     }
// }

// let menuE = [12, 'b', 'c', 0, 'e', true, false, 'h', 'i', 'j'];
// for (i = 0; i < 10; i++) {
//     if (typeof menuE[i] === 'number') {
//         console.log(menuE[i]);
//     }
// }

// let menuF = [12, 'b', 'c', 0, 'e', true, false, 'h', 'i', 'j'];
// for (i = 0; i < 10; i++) {
//     if (typeof menuF[i] === 'string') {
//         console.log(menuF[i]);
//     }
// }


// 5.Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

// let menu = [];
// menu[0] = 3;
// menu[1] = 5;
// menu[2] = 7;
// menu[3] = 0;
// menu[4] = true;
// menu[5] = false;
// menu[6] = 'a';
// menu[7] = 'b';
// menu[8] = 'c';
// menu[9] = 'd';
//
// for (i = 0; i < 10; i++) {
//     console.log(menu[i]);
// }