// Дано натуральное число n. Выведите все числа от 1 до n.

// let foo = (n) => {
//     let array = [];
//     for (let i=1; i < n; i++) {
//         array.push(i);
//     }
//     return array;
// }
// console.log(foo(5));


// Даны два целых числа A и В. Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.
//
// let foo = (a, b) => {
//     let array = [];
//             for (i = a; i >= b; i--) {
//                 if (a > b) {
//                 array.push(i);
//             }
//         }
//             for (i = a; i <= b; i++) {
//                 if (a < b) {
//             array.push(i);
//         }
//     }
//         return array;
// }
//     console.log(foo(4,9));


// функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]

// let mas = [9,8,0,4];
//
// let foo = (arr, i) => {
//     let x = arr[i];
//     arr[i] = arr[i+1];
//     arr[i+1] = x;
//     return arr;
// }
// console.log(foo(mas,2));


// Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
//     Двожина масиву від 2 до 100
// EXAMPLE:
//     [1,0,6,0,3] => [1,6,3,0,0]
//     [0,1,2,3,4] => [1,2,3,4,0]
//     [0,0,1,0]   => [1,0,0,0]

// let mas = [1,0,6,0,3];
//
// let foo = (arr) => {
//     for (i = 0; i < 100; i++) {
//     if (arr[i] === 0) {
//         let x = arr[i];
//         arr.splice(i, 1);
//         arr.push(x);
//     }
//     }
//     return arr;
// }
//
// console.log(foo(mas));