// 1. Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let a = +prompt('');
// let b = parseInt(prompt(''));
// if (a > b) {
//     console.log(a);
// } else if (a < b) {
//     console.log(b);
// } else if (a === b) {
//     console.log('рівні')
// }


// 2.У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let x = +prompt('');
// if (x >= 1 && x <= 20) {
//     console.log('1 поверх');
// } else if (x >= 21 && x <= 48) {
//     console.log('2 поверх');
// } else if (x >= 49 && x <= 90) {
//     console.log('3 поверх');
// }


// 3.Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//
// let number = +prompt('');
// if (number === 10) {
//     console.log('вірно');
// } else {
//     console.log('невірно');
// }

// 4. Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
//
// let x = 'true';
// if (typeof x === 'number') {
//     console.log('1');
// } else if (typeof x === 'string') {
//     console.log('2');
// } else if (typeof x === 'boolean') {
//     console.log('3');
// } else if (typeof x === 'object') {
//     console.log('4');
// } else {
// console.log('something else');
// }

// 5.Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
//
// let tem = 12;
// if (tem >= 10 && tem <= 22) {
//     console.log('йдемо вчитись');
// } else {
//     console.log('сидимо вдома');
// }

// 6. За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let w = +prompt();
// switch (w) {
//     case 1:
//         console.log('avto');
//         break;
//     case 2:
//         console.log('moto')
//         break;
//     case 3:
//         console.log('phone')
//         break;
//     case 4:
//         console.log('ring')
//         break;
//     case 5:
//         console.log('beer')
//         break;
//     default:
//         console.log('число не вірне')
// }


// additional


// Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
//
// let dov = friends.length;
//
// if (dov >= 3) {
//     console.log('це великий масив');
// } else {
//     console.log('це маленький масив');
// }

// Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
//
//
// let a = 5;
// let b = 13;
// let c = 12;
//
// if ((a > b && a < c) || (a < b && a > c)) {
//     console.log(a);
// } else if ((b > a && b < c) || (b < a && b > c)) {
//     console.log(b);
// } else if ((c > a && c < b) || (c < a && c > b)) {
//     console.log(c);
// }

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

// let a = 2;
// let b = 1;
// (a + b < 4) ? console.log('Мало') : console.log('Багато');


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
//
// let a = 20;
// (a > 0) ? console.log('позитивне') : (a < 0 ) ? console.log('негативне') : console.log(0);